[
  {
    "id": 1,
    "title": "Reciprocal Tariff Threat Not as Severe as Feared; Likely to Revert Quickly",
    "excerpt": "While concerns over reciprocal tariffs on India may seem alarming, sectoral nuances indicate that the actual impact could be less severe than perceived. The extent of the effect largely depends on how President Trump approaches tariff imposition.",
    "content": "While concerns over reciprocal tariffs on India may seem alarming, sectoral nuances indicate that the actual impact could be less severe than perceived. The extent of the effect largely depends on how President Trump approaches tariff imposition. Sectors that appear most vulnerable include Automobiles, Gems & Jewelry, Chemicals, and Pharma, but their risk levels vary significantly based on how tariffs are structured—whether applied broadly across countries or targeted at specific sectors or sub-sectors.\n\nFor instance, India's tariffs on automobiles (100-125%) are substantially higher than those imposed by the US, while auto component tariffs (75-10%) are relatively moderate. The actual exposure of the auto sector, therefore, hinges on the specificity of US tariff implementation. A similar pattern is observed across other vulnerable sectors, where varying tariff rates on sub-components and commodity groups complicate the assessment. Given this complexity, it is likely that the US will impose reciprocal tariffs at a broad country level rather than with a sector-specific focus. However, such tariffs could be rolled back within six months due to increasing economic and political pressure.",
    "author": "Bhavesh Sanghvi",
    "role": "CEO",
    "date": "2025-02-15",
    "readTime": "5 min read",
    "category": "Economic Analysis",
    "image": "/api/placeholder/400/250",
    "link": "https://growthfiniti.com/reciprocal-tariff-threat-not-as-severe-as-feared-likely-to-revert-quickly/"
  },
  {
    "id": 2,
    "title": "Money Trends February 2025",
    "excerpt": "Domestic equity markets declined amid ongoing uncertainty surrounding the U.S. President's plans for reciprocal tariffs, raising concerns about a prolonged trade war and potential inflationary pressures.",
    "content": "Domestic equity markets declined amid ongoing uncertainty surrounding the U.S. President's plans for reciprocal tariffs, raising concerns about a prolonged trade war and potential inflationary pressures. Investor sentiment was further dampened by the U.S. Federal Reserve's statement that it is 'not in a hurry to lower interest rates' and plans to 'pause rate cuts to evaluate further progress in inflation.'\n\nThe market volatility reflects broader concerns about global trade relationships and their impact on emerging markets like India. Key sectors showing resilience include technology services and pharmaceuticals, while traditional manufacturing sectors face headwinds from potential tariff implementations.",
    "author": "Research Team",
    "role": "Research Division",
    "date": "2025-02-28",
    "readTime": "8 min read",
    "category": "Market Analysis",
    "image": "/api/placeholder/400/250",
    "link": "https://growthfiniti.com/wp-content/uploads/2025/03/Growthfiniti-Monthly_28-Feb-2025.pdf"
  },
  {
    "id": 3,
    "title": "RBI Monetary Policy February 2025",
    "excerpt": "The Reserve Bank of India (RBI) reduced policy rates by 25bps, a decision unanimously supported by all Monetary Policy Committee (MPC) members.",
    "content": "The Reserve Bank of India (RBI) reduced policy rates by 25bps, a decision unanimously supported by all Monetary Policy Committee (MPC) members. This marks a significant shift in monetary policy stance as the central bank aims to support economic growth while maintaining price stability.\n\nThe rate cut comes amid moderated inflation expectations and signs of economic slowdown in certain sectors. The RBI's decision reflects confidence in the country's inflation trajectory and a commitment to supporting credit growth in the economy. Market participants have responded positively to this accommodative stance, with expectations of further policy support if economic conditions warrant it.",
    "author": "Policy Analysis Team",
    "role": "Economics Division",
    "date": "2025-02-07",
    "readTime": "6 min read",
    "category": "Monetary Policy",
    "image": "/api/placeholder/400/250",
    "link": "https://growthfiniti.com/rbi-monetary-policy-february-2025/"
  },
  {
    "id": 4,
    "title": "India's Economic Outlook for 2025",
    "excerpt": "Analyzing the key factors that will shape India's economic trajectory in 2025, including domestic growth drivers and global headwinds.",
    "content": "India's economic outlook for 2025 presents a mixed picture with strong domestic fundamentals offset by global uncertainties. Key growth drivers include robust domestic consumption, infrastructure investments, and the continued digital transformation across sectors.\n\nHowever, challenges remain in the form of global trade tensions, commodity price volatility, and geopolitical uncertainties. The government's focus on manufacturing through various initiatives is expected to provide medium-term support to growth, while monetary policy remains accommodative to support economic recovery.",
    "author": "Economic Research Team",
    "role": "Research Division",
    "date": "2025-01-15",
    "readTime": "10 min read",
    "category": "Economic Outlook",
    "image": "/api/placeholder/400/250",
    "link": "#"
  },
  {
    "id": 5,
    "title": "Sectoral Analysis: Technology and Innovation",
    "excerpt": "Deep dive into India's technology sector performance and innovation trends shaping the future of digital economy.",
    "content": "The technology sector continues to be a bright spot in India's economic landscape, with companies demonstrating resilience and adaptability in changing global conditions. The sector has benefited from increased digitalization trends, cloud adoption, and emerging technologies like AI and machine learning.\n\nKey themes include the evolution of software services, growth in product companies, and the expanding startup ecosystem. Regulatory developments and talent availability remain critical factors for sustained growth in this sector.",
    "author": "Sector Analysis Team",
    "role": "Research Division",
    "date": "2025-01-22",
    "readTime": "7 min read",
    "category": "Sector Analysis",
    "image": "/api/placeholder/400/250",
    "link": "#"
  },
  {
    "id": 6,
    "title": "Investment Strategy in Volatile Markets",
    "excerpt": "Strategic approaches to portfolio management during periods of market uncertainty and volatility.",
    "content": "Navigating volatile markets requires a disciplined approach to investment strategy and risk management. This analysis explores various portfolio construction techniques, asset allocation strategies, and risk management tools that can help investors weather market storms.\n\nKey considerations include diversification across asset classes, geographic regions, and investment styles. The importance of maintaining a long-term perspective while being tactically responsive to market conditions is emphasized throughout our investment framework.",
    "author": "Investment Team",
    "role": "Portfolio Management",
    "date": "2025-01-10",
    "readTime": "9 min read",
    "category": "Investment Strategy",
    "image": "/api/placeholder/400/250",
    "link": "#"
  }
] 